[
  {
    "id": "Dataphor",
    "title": "Dataphor",
    "description": "Open-source development platform",
    "body": "<p>Dataphor is an open-source application development platform designed to allow more declarative software development. It does this by automating many of the tasks involved in the creation and maintenance of database applications. The Dataphor Server provides a logical abstraction of database management systems, while Dataphor Frontend provides a logical abstraction of user interface definitions. Alphora Dataphor allows developers to focus on the creation of the core data model and underlying process logic. Based on the given data model, Dataphor dynamically derives user interfaces and enforces business rules. This data-centric approach, which is enabled by Dataphor&rsquo;s query processor and data dictionary, enables developers to focus on what it is they are modeling rather than the implementation details, shield themselves from the limitations and diversity of existing data sources, and produce more flexible applications in less time.</p><h4>USES FOR DATAPHOR</h4><ul><li>Building software applications quickly</li><li>Data integration/migration tasks</li><li>Teaching/learning about relational theory</li></ul><h4>FEATURES</h4><ul><li>Centralized and extensible data dictionary</li><li>Dynamic user interface derivation</li><li>Declarative environment for business rules</li><li>Multiple clients from a single description</li><li>Rich data manipulation algebra</li></ul><h4>TECHNOLOGY CHOICES</h4><ul><li>Database Management System (DMBS) written in C# for the version 2.0 .NET Framework</li><li>Compiler and runtime for D4 language</li><li>Integrated Development Environment (IDE) for:<ul><li>Editing and executing D4</li><li>Browsing the data dictionary catalog</li><li>Analyzing execution plans</li><li>Visually building forms, or customizing derived forms</li></ul></li><li>Windows Forms based thin client</li><li>ASP.NET based web server thin \"client\"</li><li>Libraries to access SQL Server, Oracle, DB2, and a few other data sources</li><li>Libraries for standard programming tasks as well as web-related tasks.</li></ul>",
    "images": [
      "empty-image.jpg"
    ]
  },
  {
    "id": "Fastore",
    "title": "Fastore",
    "description": "Columnar-based data storage device",
    "body": "<p>Fastore is a high-speed columnar-based data storage device developed by the Alphora team at Database Consulting Group LLC to meet the substantial storage needs of businesses everywhere. Through its unique architecture and implementation, Fastore is able to store, sort, and retrieve large amounts of data quickly and efficiently. It features rapid sorting, in-memory storage, ACID transaction support, optimistic and pessimistic concurrency, consistent disk model for backup and recovery, and much more. The product currently supports both Windows and Linux OSs and utilizes the C, C++, Java, and .NET(C#) APIs.</p><h4>TECHNICAL OVERVIEW</h4><ul><li>Since Fastore uses columnar storage, no indexes are needed, the join cost is even across columns and tables, and there is a high potential for analytic queries.</li><li>Fastore is able to store data in-memory as it utilizes memory-optimized structures; this enables durable logging and check-pointing and support for joins using random access.</li><li>Transactions can satisfy the ACID properties, with isolation via revisions and true durability with torn-page handling. Fastore uses a consistency model to facilitate backup and recovery.</li><li>Fastore supports optimistic concurrency - the application server handles the bulk of the transaction processing, conflicts result in retry, and snapshot isolation and early conflict detection can prevent data inconsistencies or failure. Pessimistic concurrency is also used in explicit locking for high contention points.</li><li>Fastore's ability to replicate its network topology across several servers allows for multi-site distribution, and thus prevents the need to scale-up. This also means there will be no single point of contention or failure, so clients can coordinate the transactions.</li><li>No latch overhead and maximized cache locality make Fastore optimal for NUMA memory architecture and disk throughput.</li></ul><p><img width=\"100%\" alt=\"Fastore Architecture\" src=\"/img/fastore-architecture.png\" /></p><h4>HIGHLIGHTS</h4><ul><li>Even and predictable performance</li><li>Eliminates most index redundancy</li><li>Ultra-high speed overall</li><li>Linear scale-out for reads</li><li>Good for analytics <em>and</em> transactions</li><li>Minimizes denormalization cases</li><li>Familiar SQL and API interfaces</li></ul>",
    "images": [
      "empty-image.jpg"
    ]
  },
  {
    "id": "FARS",
    "title": "False Alarm Reduction System (FARS)",
    "description": "Accounting and management solution for false alarms",
    "body": "FARS is an accounting and management solution developed with the expertise that comes from more than 50 years of CPA experience with cities, counties and other government agencies. Alphora understands the increasing scrutiny imposed on cities, counties and metropolitan jurisdictions regarding funding, auditing, and general accounting practices. FARS utilizes the innovative and flexible technology platform developed with Dataphor, an Alphora product. Dataphor is built on the&nbsp;</span><span><a href=\"http://www.microsoft.com/net\" target=\"_blank\">Microsoft .NET Framework</a></span></span><span>&nbsp;and is a complete development environment. This platform allows both a Windows and Web client access to the FARS application, and operates on today's major database systems, including Microsoft SQL Server. The enterprise-level architecture scales to fit the data and user volume of various organizations, from a single-user operation to a large metropolitan jurisdiction.&nbsp;</span><br/><br/>FARS is a proven alarm registration, billing and tracking system for local governments who are committed to reducing false alarm incidents in their law enforcement jurisdictions. Many cities, counties and metropolitan jurisdictions have existing dispatch, CAD (Computer Aided Dispatch), and RMS (Record Management Systems), but do not have the accounting and collection solution to assist with enforcing their false alarm ordinance. Local governments with a reasonably designed alarm (burglar or fire) ordinance ensures a reduction in false alarm incidents. Alarm reduction programs using a sound false alarm billing software application helps to ensure they are billing, collecting &amp; accounting for permits and fines for excessive false alarms.</span><br /><br/><span>The FARS application integrates well with various applications such as CAD/RMS, government finance, bulk-mail vendor, collection agency, and financial institution lockbox operation. The FARS Web Portal provides an inquiry and payment system to reduce in-house customer servicing. Built-in automated routines facilitate collecting unprocessed false alarms, invoicing and lockbox payment processing. These unattended processes are monitored by the system providing successful and un-successful rules based notifications to a managed distribution list via email.",
    "images": [
      "empty-image.jpg"
    ]
  }
]
